<div id="donation">   
    <a id="open" href="#msg">
        <img src="../../sources/donation.png">
    </a>

    <div id="msg" name="msg">
        <h5 id="txt">Здравствуйте! Спасибо, что открыли меня. Если Вы хотите материально поддержать проект, то нажмите на кнопку "Поддержать".</h5>
        <a href="" id="close"><svg height="365.696pt" viewBox="0 0 365.696 365.696" width="365.696pt" style="fill: #fff; height: 60%; width: 60%; display: block; margin: auto; top: 20%; position: relative;" xmlns="http://www.w3.org/2000/svg"><path d="m243.1875 182.859375 113.132812-113.132813c12.5-12.5 12.5-32.765624 0-45.246093l-15.082031-15.082031c-12.503906-12.503907-32.769531-12.503907-45.25 0l-113.128906 113.128906-113.132813-113.152344c-12.5-12.5-32.765624-12.5-45.246093 0l-15.105469 15.082031c-12.5 12.503907-12.5 32.769531 0 45.25l113.152344 113.152344-113.128906 113.128906c-12.503907 12.503907-12.503907 32.769531 0 45.25l15.082031 15.082031c12.5 12.5 32.765625 12.5 45.246093 0l113.132813-113.132812 113.128906 113.132812c12.503907 12.5 32.769531 12.5 45.25 0l15.082031-15.082031c12.5-12.503906 12.5-32.769531 0-45.25zm0 0"/></svg></a>
        <a href="https://www.donationalerts.com/r/igryivseyt" target="_blank" style="text-decoration: none;"><button id="link" type="button">Поддержать</button></a>
    </div>
</div>