<!DOCTYPE html>
<html>
    <head>
        <title>Игры и всё - Обо мне</title>
        <link rel="stylesheet" href="mobile/css/about.css" type="text/css"/>
    </head>
    <body>
        <div></div>
        <main id="main">
                <h3 class="txt">Моё основное увлечение сейчас - программирование. Именно по этому я<br>и решил создать этот сайт. Мой любимый язык C++, но я пытаюсь развиваться<br>не только в нём. Все проекты с открытым кодом можно посмотреть на моём GitHub<br>аккаунте. Найти его можно в категории "Соц. сети" или подвале сайта.</h3>

                <h3 class="txt">Я стримлю и снимаю видео по играм, а также немного о программировании.<br>Всё это можно найти на моём Youtube канале, ссылка на который<br>находится в категории "Соц. сети". Буду рад,<br>если Вы перейдёте и проявите активность. Новые стримы / видео<br>стараюсь выпускать как можно чаще (по мере своих возможностей).</h3>

                <h3 class="txt">В жизни я (почти) обычный 13-ти летний школьник. Почему почти?<br>Ну...я люблю программировать и слушаю довольно странную музыку.<br>А в целом, я ничем не отличаюсь от остальных, но я не думаю,<br>что Вы захотели бы со мной встретиться в реальности.</h3>
        </main>
    </body>
</html>